cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32GG232F512.svd
        <register>
          <name>PB_MODEH</name>
          <description>Port Pin Mode High Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE8</name>
              <description>Pin 8 Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled. Pullup if DOUT is set.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter. DOUT determines pull direction</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLDRIVE</name>
                  <description>Push-pull output with drive-strength set by DRIVEMODE</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVE</name>
                  <description>Open-drain output with drive-strength set by DRIVEMODE</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEFILTER</name>
                  <description>Open-drain output with filter and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUP</name>
                  <description>Open-drain output with pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUPFILTER</name>
                  <description>Open-drain output with filter, pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE9</name>
              <description>Pin 9 Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled. Pullup if DOUT is set.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter. DOUT determines pull direction</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLDRIVE</name>
                  <description>Push-pull output with drive-strength set by DRIVEMODE</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVE</name>
                  <description>Open-drain output with drive-strength set by DRIVEMODE</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEFILTER</name>
                  <description>Open-drain output with filter and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUP</name>
                  <description>Open-drain output with pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUPFILTER</name>
                  <description>Open-drain output with filter, pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE10</name>
              <description>Pin 10 Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled. Pullup if DOUT is set.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter. DOUT determines pull direction</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLDRIVE</name>
                  <description>Push-pull output with drive-strength set by DRIVEMODE</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVE</name>
                  <description>Open-drain output with drive-strength set by DRIVEMODE</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEFILTER</name>
                  <description>Open-drain output with filter and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUP</name>
                  <description>Open-drain output with pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUPFILTER</name>
                  <description>Open-drain output with filter, pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE11</name>
              <description>Pin 11 Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled. Pullup if DOUT is set.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter. DOUT determines pull direction</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLDRIVE</name>
                  <description>Push-pull output with drive-strength set by DRIVEMODE</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVE</name>
                  <description>Open-drain output with drive-strength set by DRIVEMODE</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEFILTER</name>
                  <description>Open-drain output with filter and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUP</name>
                  <description>Open-drain output with pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUPFILTER</name>
                  <description>Open-drain output with filter, pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE12</name>
              <description>Pin 12 Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled. Pullup if DOUT is set.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter. DOUT determines pull direction</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLDRIVE</name>
                  <description>Push-pull output with drive-strength set by DRIVEMODE</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output</description>
                  <value>0x00000006</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDORPULLDOWN</name>
                  <description>Wired-or output with pull-down</description>
                  <value>0x00000007</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDAND</name>
                  <description>Open-drain output</description>
                  <value>0x00000008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDFILTER</name>
                  <description>Open-drain output with filter</description>
                  <value>0x00000009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUP</name>
                  <description>Open-drain output with pullup</description>
                  <value>0x0000000A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDPULLUPFILTER</name>
                  <description>Open-drain output with filter and pullup</description>
                  <value>0x0000000B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVE</name>
                  <description>Open-drain output with drive-strength set by DRIVEMODE</description>
                  <value>0x0000000C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEFILTER</name>
                  <description>Open-drain output with filter and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUP</name>
                  <description>Open-drain output with pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDANDDRIVEPULLUPFILTER</name>
                  <description>Open-drain output with filter, pullup and drive-strength set by DRIVEMODE</description>
                  <value>0x0000000F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE13</name>
              <description>Pin 13 Mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input disabled. Pullup if DOUT is set.</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input enabled. Filter if DOUT is set</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULL</name>
                  <description>Input enabled. DOUT determines pull direction</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INPUTPULLFILTER</name>
                  <description>Input enabled with filter. DOUT determines pull direction</description>
                  <value>0x00000003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Push-pull output</description>
                  <value>0x00000004</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULLDRIVE</name>
                  <description>Push-pull output with drive-strength set by DRIVEMODE</description>
                  <value>0x00000005</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIREDOR</name>
                  <description>Wired-or output</description>
                  <value>0x00000006</value>
                </enumeratedValue>
